[
  {
    "date": "2025-07-20",
    "quote": "He who does justice will live in the presence of the Lord.",
    "summary": "First Reading (Gen 18) – Abraham shows hospitality to three visitors, foreshadowing the promise of a son. Psalm (Ps 15) – Teaches that the righteous and just shall 'live in the presence of the Lord'. Gospel (Luke 10) – Martha is anxious in service while Mary sits and listens to Jesus, choosing 'the better part'. Saint Apollinaris, bishop and martyr, is commemorated today.",
    "expanded_exegesis": "In Genesis 18 the LORD appears to Abraham by the tent. Abraham quickly prepares a great meal for the mysterious visitors and waits on them under a tree. One of the visitors (the LORD) then promises Sarah will bear a son. The Responsorial Psalm (15) lists the traits of those who dwell with God: blameless, truthful, and just. Paul’s letter (Col 1) rejoices that his sufferings 'fill up what is lacking' in Christ’s afflictions, extending the gospel to all peoples. In Luke 10, Jesus contrasts Martha’s worried service with Mary’s attentive listening, declaring that Mary 'has chosen the better part, which will not be taken away from her'. Saint Apollinaris faithfully served the Church; his feast inspires us to patient faith.",
    "prayer": "Lord, help us welcome others with Abraham’s generous heart and to live justly before you. Teach us to heed your word like Mary, choosing the better part of listening to you. May our lives reflect the hope of Christ’s glory even through suffering. Amen.",
    "link_to_usccb_readings_of_the_day": "https://bible.usccb.org/bible/readings/072025.cfm"
  },
  {
    "date": "2025-07-21",
    "quote": "Fear not! Stand your ground... The Lord himself will fight for you.",
    "summary": "First Reading (Ex 14) – At the Red Sea, Moses instructs Israel, 'Fear not! ... The LORD himself will fight for you', as God parts the sea. Psalm (Ex 15, Song of Moses) – The people sing to the LORD, exalting Him as 'a warrior' who has triumphed gloriously. Gospel (Matt 12) – Jesus promises only the 'sign of Jonah' and warns that Ninevites and the Queen of Sheba will condemn those who refuse to repent. Saint Lawrence of Brindisi is commemorated.",
    "expanded_exegesis": "In Exodus 14, Moses tells the Israelites not to fear as God parts the sea and defeats Pharaoh’s army. Psalm 15 (Ex 15) is a hymn of victory, praising God’s power. In Matthew 12, Jesus says He will give only the 'sign of Jonah'—His resurrection—and warns of judgment for unrepentant hearts. Saint Lawrence of Brindisi was a scholarly preacher and military chaplain. The readings call for faith over fear, and to believe even without signs.",
    "prayer": "Lord God, in times of trial make us stand firm in faith like your people of old. May we recognize your salvation even without signs, praising you as Moses and Mary did. Saint Lawrence, intercede for our own zeal to study and live the Word. Amen.",
    "link_to_usccb_readings_of_the_day": "https://bible.usccb.org/bible/readings/072125.cfm"
  },
  {
    "date": "2025-07-22",
    "quote": "My soul thirsts for You, my God, like a dry and weary land.",
    "summary": "Reading (Song 3 or 2 Cor 5) – Song of Songs speaks of seeking the beloved. Psalm 63 – A cry of thirst and longing for God. Gospel (John 20) – Mary Magdalene is the first witness of the Resurrection. Saint Mary Magdalene is honored today.",
    "expanded_exegesis": "Song of Songs 3 expresses longing for the beloved, symbolizing the soul’s yearning for God. Paul reminds us that we are new creations in Christ. Psalm 63 expresses deep thirst for God. In John 20, Mary Magdalene’s encounter with the risen Jesus shows personal love and faithful seeking. She is the Apostle to the Apostles—the first to proclaim the Resurrection.",
    "prayer": "Lord, you are the water that satisfies our deepest thirst. Like Mary Magdalene, may we recognize you when you speak our name, and proclaim your resurrection with joy. Help us to be new creations in Christ. Amen.",
    "link_to_usccb_readings_of_the_day": "https://bible.usccb.org/bible/readings/072225.cfm"
  },
  {
    "date": "2025-07-23",
    "quote": "The Lord gave them bread from heaven.",
    "summary": "First Reading (Ex 16) – God provides manna. Psalm 78 – Celebrates the miracle of bread from heaven. Gospel (Matt 13) – Parable of the Sower. Saint Bridget of Sweden is honored.",
    "expanded_exegesis": "In Exodus, God sends manna daily to teach Israel dependence and trust. Psalm 78 recounts this act of provision as a reminder of God's faithfulness. Jesus’ parable in Matthew 13 teaches that hearts, like soil, must be prepared to bear fruit. Saint Bridget, a mystic and founder, models devotion and prayerful response to God’s word.",
    "prayer": "Heavenly Father, nourish us with Your word as You did with manna of old. Give us hearts that receive Your seed and bear a rich harvest of faith. Saint Bridget, intercede that we live with joy in God’s promises. Amen.",
    "link_to_usccb_readings_of_the_day": "https://bible.usccb.org/bible/readings/072325.cfm"
  }
]
